<h1>3.2 数据预处理工具：Pandas<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#3.2.1-Series与DataFrame介绍" data-toc-modified-id="3.2.1-Series与DataFrame介绍-1">3.2.1 Series与DataFrame介绍</a></span><ul class="toc-item"><li><span><a href="#1.Series介绍" data-toc-modified-id="1.Series介绍-1.1">1.Series介绍</a></span></li><li><span><a href="#2.DataFrame介绍" data-toc-modified-id="2.DataFrame介绍-1.2">2.DataFrame介绍</a></span></li></ul></li><li><span><a href="#3.2.2-数据加载" data-toc-modified-id="3.2.2-数据加载-2">3.2.2 数据加载</a></span><ul class="toc-item"><li><span><a href="#1.-read_csv-/read_table函数" data-toc-modified-id="1.-read_csv-/read_table函数-2.1">1. read_csv /read_table函数</a></span></li><li><span><a href="#2.-read_excel函数" data-toc-modified-id="2.-read_excel函数-2.2">2. read_excel函数</a></span></li><li><span><a href="#3.-read_sql函数" data-toc-modified-id="3.-read_sql函数-2.3">3. read_sql函数</a></span></li></ul></li><li><span><a href="#3.2.3-数据拼接" data-toc-modified-id="3.2.3-数据拼接-3">3.2.3 数据拼接</a></span><ul class="toc-item"><li><span><a href="#1.merge方法" data-toc-modified-id="1.merge方法-3.1">1.merge方法</a></span></li><li><span><a href="#2.join方法" data-toc-modified-id="2.join方法-3.2">2.join方法</a></span></li><li><span><a href="#3.concat方法" data-toc-modified-id="3.concat方法-3.3">3.concat方法</a></span><ul class="toc-item"><li><span><a href="#（1）行拼接" data-toc-modified-id="（1）行拼接-3.3.1">（1）行拼接</a></span></li><li><span><a href="#（2）列拼接" data-toc-modified-id="（2）列拼接-3.3.2">（2）列拼接</a></span></li></ul></li></ul></li><li><span><a href="#3.2.4-数据聚合" data-toc-modified-id="3.2.4-数据聚合-4">3.2.4 数据聚合</a></span></li><li><span><a href="#3.2.5-数据透视表和交叉表" data-toc-modified-id="3.2.5-数据透视表和交叉表-5">3.2.5 数据透视表和交叉表</a></span><ul class="toc-item"><li><span><a href="#1.数据透视表" data-toc-modified-id="1.数据透视表-5.1">1.数据透视表</a></span></li><li><span><a href="#2.交叉表" data-toc-modified-id="2.交叉表-5.2">2.交叉表</a></span></li></ul></li><li><span><a href="#3.2.6-广告缺失值处理" data-toc-modified-id="3.2.6-广告缺失值处理-6">3.2.6 广告缺失值处理</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#（1）删除缺失值" data-toc-modified-id="（1）删除缺失值-6.0.1">（1）删除缺失值</a></span></li><li><span><a href="#（2）缺失值填充" data-toc-modified-id="（2）缺失值填充-6.0.2">（2）缺失值填充</a></span></li></ul></li></ul></li></ul></div>

# 3.2.1 Series与DataFrame介绍

## 1.Series介绍

In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1,2,3,np.nan,5])
s

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
dtype: float64

In [3]:
s2 = pd.Series([1,2,3,np.nan,5],index =[100,101,102,103,104])
print(s2)

100    1.0
101    2.0
102    3.0
103    NaN
104    5.0
dtype: float64

In [4]:
s2.index

Int64Index([100, 101, 102, 103, 104], dtype='int64')

In [5]:
s2.values

array([ 1.,  2.,  3., nan,  5.])

## 2.DataFrame介绍

In [6]:
df1 = pd.DataFrame({'ID':pd.Series([1,2,3,4,5,6]),
             'Age':pd.Series([18,50,32,22,16,25])}
             )
print(df1)

   ID  Age
0   1   18
1   2   50
2   3   32
3   4   22
4   5   16
5   6   25

In [7]:
df1['ID']

0    1
1    2
2    3
3    4
4    5
5    6
Name: ID, dtype: int64

In [8]:
df1[['ID','Age']]

   ID  Age
0   1   18
1   2   50
2   3   32
3   4   22
4   5   16
5   6   25

In [9]:
df1['Sex'] = ['F','M','M','F','M','F']
df1

   ID  Age Sex
0   1   18   F
1   2   50   M
2   3   32   M
3   4   22   F
4   5   16   M
5   6   25   F

In [10]:
df1.drop('Sex',axis=1)

   ID  Age
0   1   18
1   2   50
2   3   32
3   4   22
4   5   16
5   6   25

In [11]:
df1.loc[3]

ID      4
Age    22
Sex     F
Name: 3, dtype: object

# 3.2.2 数据加载

##  1. read_csv /read_table函数

In [12]:
df2 = pd.read_csv('../data/ex2.csv',encoding='gbk')
df2.head()

       Date Phone_type   System     Age Sex
0  20200107       华为手机  android  19~25岁   F
1  20200107       苹果手机      iOS  26~35岁   M
2  20200107       苹果手机      iOS  26~35岁   M
3  20200107       小米手机  android  26~35岁   M
4  20200107       魅族手机  android  26~35岁   M

In [13]:
df2 = pd.read_table('../data/ex2.csv',sep = ',',encoding='gbk')
df2.head()

       Date Phone_type   System     Age Sex
0  20200107       华为手机  android  19~25岁   F
1  20200107       苹果手机      iOS  26~35岁   M
2  20200107       苹果手机      iOS  26~35岁   M
3  20200107       小米手机  android  26~35岁   M
4  20200107       魅族手机  android  26~35岁   M

In [14]:
df2 = pd.read_csv('../data/ex2.csv', names=[
                  'Date', 'Phone_type', 'System', 'Age', 'Sex']
                 ,encoding='gbk')
df2.head()

       Date  Phone_type   System     Age  Sex
0      Date  Phone_type   System     Age  Sex
1  20200107        华为手机  android  19~25岁    F
2  20200107        苹果手机      iOS  26~35岁    M
3  20200107        苹果手机      iOS  26~35岁    M
4  20200107        小米手机  android  26~35岁    M

In [15]:
df2 = pd.read_csv('../data/ex2.csv', parse_dates=[0], names=[
                  'Date', 'Phone_type', 'System', 'Age', 'Sex']
                 ,encoding='gbk')
df2.head()

       Date  Phone_type   System     Age  Sex
0      Date  Phone_type   System     Age  Sex
1  20200107        华为手机  android  19~25岁    F
2  20200107        苹果手机      iOS  26~35岁    M
3  20200107        苹果手机      iOS  26~35岁    M
4  20200107        小米手机  android  26~35岁    M

In [16]:
df2 = pd.read_csv('../data/ex2.csv', sep='\t', names=[
                  'Date', 'Phone_type', 'System', 'Age', 'Sex'], 
                  parse_dates=[0], skiprows=[1, 3, 5],
                  index_col=3, nrows=4, encoding='gbk')
df2

                                Date  Phone_type  System  Sex
Age
NaN   Date,Phone_type,System,Age,Sex         NaN     NaN  NaN
NaN       20200107,苹果手机,iOS,26~35岁,M         NaN     NaN  NaN
NaN   20200107,小米手机,android,26~35岁,M         NaN     NaN  NaN
NaN  20200107,VIVO手机,android,0~18岁,F         NaN     NaN  NaN

## 2. read_excel函数

In [17]:
df3 = pd.read_excel('../data/ex3.xlsx',sheet_name=0)
df3.head()

       Date Phone_type   System     Age Sex
0  20200107       华为手机  android  19~25岁   F
1  20200107       苹果手机      iOS  26~35岁   M
2  20200107       苹果手机      iOS  26~35岁   M
3  20200107       小米手机  android  26~35岁   M
4  20200107       魅族手机  android  26~35岁   M

## 3. read_sql函数

In [50]:
import pymysql
from sqlalchemy import create_engine

DB_USER = 'root'
DB_PASS = 'root'
DB_HOST = '127.0.0.1'
DB_PORT = 3306
DATABASE = 'firstdb'
connect_info = 'mysql+pymysql://{}:{}@{}:{}/{}?charset=utf8'.format(
    DB_USER, DB_PASS, DB_HOST, DB_PORT, DATABASE)
engine = create_engine(connect_info)
# sql 命令
sql_cmd = "SELECT * FROM customer"
df = pd.read_sql(sql=sql_cmd, con=engine)
df

# 3.2.3 数据拼接

## 1.merge方法

In [19]:
left_df = pd.DataFrame({"ID":[1,2,3,4,5],
                       "Name":['A',"B","C","D","E"]})
right_df = pd.DataFrame({"ID":[1,2,3,5,6],
                        "Age":[18,19,16,50,20]})

In [20]:
df1 = pd.merge(left_df,right_df,how = 'inner',on = 'ID')
df1

   ID Name  Age
0   1    A   18
1   2    B   19
2   3    C   16
3   5    E   50

In [21]:
df2 = pd.merge(left_df,right_df,how = 'left',on = 'ID')
df2

   ID Name   Age
0   1    A  18.0
1   2    B  19.0
2   3    C  16.0
3   4    D   NaN
4   5    E  50.0

In [22]:
df3 = pd.merge(left_df,right_df,how = 'right',on = 'ID')
df3

   ID Name  Age
0   1    A   18
1   2    B   19
2   3    C   16
3   5    E   50
4   6  NaN   20

In [23]:
df4 = pd.merge(left_df,right_df,how = 'outer',on = 'ID')
df4

   ID Name   Age
0   1    A  18.0
1   2    B  19.0
2   3    C  16.0
3   4    D   NaN
4   5    E  50.0
5   6  NaN  20.0

In [24]:
left_df2 = pd.DataFrame({"ID":[1,2,3,4,5],
                         "No":[100,101,102,103,104],
                       "Name":['A',"B","C","D","E"]})
right_df2 = pd.DataFrame({"ID":[1,2,3,5,6],
                          "No":[100,101,102,103,105],
                        "Age":[18,19,16,50,20]})
df5 = pd.merge(left_df2,right_df2,how = 'left',on = ['ID','No'])
df5

   ID   No Name   Age
0   1  100    A  18.0
1   2  101    B  19.0
2   3  102    C  16.0
3   4  103    D   NaN
4   5  104    E   NaN

## 2.join方法

In [25]:
left_df.join(right_df,lsuffix="_left",rsuffix="_right")

   ID_left Name  ID_right  Age
0        1    A         1   18
1        2    B         2   19
2        3    C         3   16
3        4    D         5   50
4        5    E         6   20

## 3.concat方法

### （1）行拼接

In [26]:
df1 = pd.DataFrame({'A': [100,102,50,580], 'B': [2,5,6,8]})
df2 = pd.DataFrame({'A': [20,30,30,60],'C': [1,2,3,5]})
pd.concat([df1,df2])

C:\Users\ASUS\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  This is separate from the ipykernel package so we can avoid doing imports until

     A    B    C
0  100  2.0  NaN
1  102  5.0  NaN
2   50  6.0  NaN
3  580  8.0  NaN
0   20  NaN  1.0
1   30  NaN  2.0
2   30  NaN  3.0
3   60  NaN  5.0

### （2）列拼接

In [27]:
pd.concat([df1,df2],axis=1)

     A  B   A  C
0  100  2  20  1
1  102  5  30  2
2   50  6  30  3
3  580  8  60  5

In [28]:
pd.concat([df1,df2],axis=1)

     A  B   A  C
0  100  2  20  1
1  102  5  30  2
2   50  6  30  3
3  580  8  60  5

# 3.2.4 数据聚合

In [29]:
df = pd.read_csv('../data/ex2.csv',names=['Date','Phone_type','System','Age','Sex'],encoding='gbk')
df['Num'] = range(len(df))

In [30]:
grp = df.groupby('System')['Num']
grp

In [31]:
grp.mean()

System
System      0.000000
android    25.222222
iOS        25.826087
Name: Num, dtype: float64

In [32]:
df.groupby(['System','Sex'])['Num'].mean()

System   Sex
System   Sex     0.000000
android  F      25.555556
         M      24.555556
iOS      F      26.833333
         M      23.571429
         未知     26.750000
Name: Num, dtype: float64

In [33]:
def myfun(obj):
    return np.mean(obj ** 2 - 10)

df.groupby(['System'])['Num'].apply(myfun)

System
System     -10.000000
android    830.703704
iOS        869.391304
Name: Num, dtype: float64

# 3.2.5 数据透视表和交叉表

## 1.数据透视表

In [34]:
df.pivot_table(index='Sex')

           Num
Sex
F    26.066667
M    24.125000
Sex   0.000000
未知   26.750000

In [35]:
df.pivot_table(index=["System","Sex"],aggfunc=sum)

             Num
System  Sex
System  Sex    0
android F    460
        M    221
iOS     F    322
        M    165
        未知   107

In [36]:
df.pivot_table(index =["Sex"],columns=['System'],aggfunc="mean")

          Num
System System    android        iOS
Sex
F         NaN  25.555556  26.833333
M         NaN  24.555556  23.571429
Sex       0.0        NaN        NaN
未知        NaN        NaN  26.750000

## 2.交叉表

In [37]:
pd.crosstab(index = df['Sex'],columns=df['Age'])

Age  0~18岁  19~25岁  26~35岁  36~45岁  Age  未知
Sex
F        5      12      11       2    0   0
M        2       4       9       1    0   0
Sex      0       0       0       0    1   0
未知       0       0       0       0    0   4

In [38]:
df.pivot_table(index=["Sex"], columns='Age', values='Num', aggfunc="count")

Age  0~18岁  19~25岁  26~35岁  36~45岁  Age   未知
Sex
F      5.0    12.0    11.0     2.0  NaN  NaN
M      2.0     4.0     9.0     1.0  NaN  NaN
Sex    NaN     NaN     NaN     NaN  1.0  NaN
未知     NaN     NaN     NaN     NaN  NaN  4.0

# 3.2.6 广告缺失值处理

In [39]:
df = pd.DataFrame({"ID":[1,2,np.NaN,4,5],
                 "Name":['A',np.NaN,np.NaN,"D","E"],
                  "No":[100,101,102,103,105]})
df.isnull()

      ID   Name     No
0  False  False  False
1  False   True  False
2   True   True  False
3  False  False  False
4  False  False  False

In [40]:
df.isnull().mean()

ID      0.2
Name    0.4
No      0.0
dtype: float64

In [41]:
df.notnull()

      ID   Name    No
0   True   True  True
1   True  False  True
2  False  False  True
3   True   True  True
4   True   True  True

### （1）删除缺失值

In [42]:
df.dropna()

    ID Name   No
0  1.0    A  100
3  4.0    D  103
4  5.0    E  105

In [43]:
df.dropna(how = 'all')

    ID Name   No
0  1.0    A  100
1  2.0  NaN  101
2  NaN  NaN  102
3  4.0    D  103
4  5.0    E  105

In [44]:
df.dropna(axis=1)

    No
0  100
1  101
2  102
3  103
4  105

### （2）缺失值填充

In [45]:
df.fillna('miss')

     ID  Name   No
0     1     A  100
1     2  miss  101
2  miss  miss  102
3     4     D  103
4     5     E  105

In [46]:
df.fillna({'ID':3,"Name":'miss'})

    ID  Name   No
0  1.0     A  100
1  2.0  miss  101
2  3.0  miss  102
3  4.0     D  103
4  5.0     E  105

In [47]:
df.fillna({0:3,1:'MISS'})

    ID Name   No
0  1.0    A  100
1  2.0  NaN  101
2  NaN  NaN  102
3  4.0    D  103
4  5.0    E  105

In [48]:
df.loc[4,'ID'] = np.NaN
df

    ID Name   No
0  1.0    A  100
1  2.0  NaN  101
2  NaN  NaN  102
3  4.0    D  103
4  NaN    E  105

In [49]:
df.fillna(df.mean())

         ID Name   No
0  1.000000    A  100
1  2.000000  NaN  101
2  2.333333  NaN  102
3  4.000000    D  103
4  2.333333    E  105